Community-PIO-CH32V/ArduinoCore-CH32H4/boards.txt
# Arduino IDE board definition. PlatformIO reads the board JSON in
# platform-ch32v instead; this file is here so the core is usable from the
# Arduino IDE and boards manager as well.

menu.exceptions=C++ Exceptions

ch32h417qeu6.name=CH32H417QEU6-R0-1v1
ch32h417qeu6.build.core=ch32h4
ch32h417qeu6.build.variant=CH32H417QEU6
ch32h417qeu6.build.mcu=ch32h417qeu6
ch32h417qeu6.build.f_cpu=400000000L
ch32h417qeu6.build.board=CH32H417QEU6
ch32h417qeu6.build.march=rv32imafc_zba_zbb_zbc_zbs_xw
ch32h417qeu6.build.mabi=ilp32f
ch32h417qeu6.upload.maximum_size=933888
ch32h417qeu6.upload.maximum_data_size=917504

# Off by default, as in arduino-pico and the ESP cores. Enabling costs roughly
# 30 KB of unwind tables, which stay in flash and are read only when something
# throws. Note that --specs=nano.specs must never be added: it rewrites
# -lstdc++ to -lstdc++_nano, which has no .eh_frame, and every throw then
# reaches std::terminate after a perfectly clean link.
ch32h417qeu6.menu.exceptions.Disabled=Disabled
ch32h417qeu6.menu.exceptions.Disabled.build.exceptions=disabled
ch32h417qeu6.menu.exceptions.Enabled=Enabled
ch32h417qeu6.menu.exceptions.Enabled.build.exceptions=enabled
